text/06-operator-precedence.org
#+title: Chapter 6 : Operator Precedence Parsing
* <<intro>>

In previous chapters we have seen several parsers, evaluators and translators.

All used /recursive descent/, one of the top down methods.  This chapter introduces one very simple form of /bottom up/ parsing and translating.

