06-operator-precedence.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 6 : Operator Precedence Parsing</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 6 : Operator Precedence Parsing"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:38:08 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 6 : Operator Precedence Parsing</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 Bottom up parsing</a></li>
<li><a href="#sec-3">3 Precedence relations</a>
<ul>
<li><a href="#sec-3-1">3.1 The algorithm</a></li>
<li><a href="#sec-3-2">3.2 The program</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Precedence functions</a>
<ul>
<li><a href="#sec-4-1">4.1 The algorithm</a></li>
<li><a href="#sec-4-2">4.2 The program</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Exercises and reading</a>
<ul>
<li><a href="#sec-5-1">5.1 <i>Ad hoc error detection</i>:</a></li>
<li><a href="#sec-5-2">5.2 <i>Parsing without tables</i>:</a></li>
<li><a href="#sec-5-3">5.3 <i>Changing the tables</i>:</a></li>
<li><a href="#sec-5-4">5.4 <i>Evaluator</i>:</a></li>
<li><a href="#sec-5-5">5.5 <i>Non-recursive truth table program</i>:</a></li>
<li><a href="#sec-5-6">5.6 <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
In previous chapters we have seen several parsers, evaluators and translators.
</p>
<p>
All used <i>recursive descent</i>, one of the top down methods.  This chapter introduces one very simple form of <i>bottom up</i> parsing and translating.
</p>
</div>

</div>
