text/06-operator-precedence.org
* Bottom up parsing

Consider the following fragment of a Pascal program:

#+begin_example
        IF  x = 0  THEN  y := 1
#+end_example

You can see immediately that this is a statement, and not a program or an expression or a factor or anything else.  A recursive descent compiler for Pascal will recognise it as a statement, but only if the compiler is currently expecting a statement.  If it is currently expecting a program or a type or an expression or something else, then it will respond with error messages.  Note that you were able to recognise the fragment because you had no expectations.  This is an essential difference between a top down parsing method like recursive descent, and the bottom up method you were using in your head.  In this chapter we shall study bottom up methods applied to parsing and translating.  In all of these the parser does not start off with definite expectations but reads symbols as they come along and makes sense of them.

The basic idea is that just as expressions can be evaluated by several passes which evaluate subexpressions, so sequences of symbols can be parsed by several passes which parse subexpressions.  First, consider the following equivalent formulas in prefix, in fully parenthesised infix, and in postfix notation: All three are to be evaluated, by rewriting leftmost subformulas by their values when possible; note that /time flows from top to bottom/:

#+begin_example
prefix:                 infix:                      postfix:
> - = 0 - & 1 1 0       (-(0 = -(1 & 1)) > 0)       0 1 1 & - = - 0 >
> - = 0 - 1     0       (-(0 = -   1   ) > 0)       0     1 - = - 0 >
> - = 0 0       0       (-(0 = 0       ) > 0)       0       0 = - 0 >
> - 1           0       (-   1           > 0)                 1 - 0 >
> 0             0       (0               > 0)                   0 0 >
1                                        1                          1
#+end_example

If we ignore the difference in meaning between the various operands and operators and merely consider syntax, then we could rewrite all well-formed subformulas by =F= to indicate that they are formulas, like this:

#+begin_example
prefix:                 infix:                      postfix:
> - = 0 - & 1 1 0       (-(0 = -(1 & 1)) > 0)       0 1 1 & - = - 0 >
> - = F - & 1 1 0       (-(F = -(1 & 1)) > 0)       F 1 1 & - = - 0 >
> - = F - & F 1 0       (-(F = -(F & 1)) > 0)       F F 1 & - = - 0 >
> - = F - & F F 0       (-(F = -(F & F)) > 0)       F F F & - = - 0 >
> - = F - F     0       (-(F = -   F   ) > 0)       F     F - = - 0 >
> - = F F       0       (-(F = F       ) > 0)       F       F = - 0 >
> - F           0       (-   F           > 0)                 F - 0 >
> F             0       (F               > 0)                   F 0 >
> F             F       (F               > F)                   F F >
F                                        F                          F
#+end_example

As described, the method would require us to always start at the beginning of the symbol sequence and perform the first replacement, just as we did for evaluation by replacement.  But from our truth table program you will remember that a very good method for evaluating uses an auxiliary stack which contains whatever needs to be remembered about the values computed so far.  We could even imagine a method which is less efficient than the one we used there, but which is interesting; as we pass through the postfix formula, we push all symbols onto the stack, operands and operators.  If /at any time/ the top few elements of the stack consist of a few operands topped by an operator, we interrupt the pushing and replace the operator and its operands by the result value.  For comparison, here are the two evaluation methods; note that /time flows from left to right/:

#+begin_example
efficient method:               less efficient method:
0 1 1 & - = - 0 >               0 1 1 &   -   =   -   0 >
                                      &
    1                               1 1   -   =         >
  1 1 1 0     0                   1 1 1 1 1 0 0   -   0 0
0 0 0 0 0 1 0 0 1               0 0 0 0 0 0 0 0 1 1 0 0 0 1
#+end_example

For either method, if instead of 0 and 1 on the stack we always had =F= (for =formula=), we would have a parsing method which avoids having to restart at the beginning of the formula every time.  This is how it will look:

#+begin_example
efficient method:               less efficient method:
0 1 1 & - = - 0 >               0 1 1 &   -   =   -   0 >
                                      &
    F                               F F   -   =         >
  F F F F     F                   F F F F F F F   -   F F
F F F F F F F F F               F F F F F F F F F F F F F F
#+end_example

The less efficient method lends itself to becoming a very general parsing method which can be used for the other notations, too.  Here it is used for fully parenthesised infix notation:

#+begin_example
        ( - ( 0 = - ( 1 & 1 )     )     > 0 )
                            )
                          F F
                        & & &
                      F F F F
                    ( ( ( ( ( F   )
                  - - - - - - - F F
                = = = = = = = = = =         )
              F F F F F F F F F F F       F F
            ( ( ( ( ( ( ( ( ( ( ( ( F   > > >
          - - - - - - - - - - - - - - F F F F
        ( ( ( ( ( ( ( ( ( ( ( ( ( ( ( ( ( ( ( F
                              1 2   3 4       5
#+end_example

Note that most steps push the current input symbol onto the stack, but there are five /reduction/ steps, marked =1..5=.  Here is a brief formulation of the algorithm:

#+begin_example
        start with an empty stack
        REPEAT
            IF the top few symbols on the stack can be replaced by
                    a single one in accordance with the grammar
                THEN do the replacement
                ELSE push the next symbol onto the stack
            UNTIL the end of the string has been reached
#+end_example

At the end of this, the stack should contain a single non-terminal of the grammar, and this is what has been recognised.  As described, the algorithm is not very efficient, because for example in the case of fully parenthesised infix formulas up to five symbols on the stack have to be examined in the =IF= part.  To improve the algorithm, we can make partial reductions and also make the applicability of reductions depend on the next input symbol.  This idea is used in most bottom up parsers, including the two very specialised ones to follow.

* Precedence relations

In the remainder of this chapter we shall look at two related bottom up parsing methods which are very simple and efficient, but are applicable only to a rather narrow class of languages.

