text/06-operator-precedence.org
** The algorithm

Consider arithmetic or logical expressions in minimally parenthesised notation as written in the first line and their fully parenthesised form in the second line.

#+begin_example
        x +  y * z                      p v  q & r
        x + (y * z)                     p v (q & r)
#+end_example

The usual convention is that =*= binds more strongly than =+=, and that =&= binds more strongly than =v=.  Hence =y= is an operand to =*= and not to =+=, and =q= is an operand to =&= and not to =v=.  It helps to think of the operators on the left and right of =y= and =q= tugging at it, and =*= and =&= win.  The technical notion is that =*= has precedence over =+=, and that =&= has precedence over =v=.  For binary operators that are semantically associative it does not matter whether they have precedence over themselves, but for others it is important to distinguish those that are syntactically left-associative (such as subtraction and implication), and those that are syntactically right-associative (such as exponentiation in arithmetic).

We shall now design a parser for logical formulas in minimally parenthesised infix notation.  In the following table, the row headings are for the operator on the left of the disputed operand, and the column headings are for the operator on the right of the operand.  The table entries =>= indicate that the row operator, when on the left, has precedence over the column operator, when on the right.  The table entries =<= indicate the reverse.

#+begin_example
                "&"   "v"   ">"
              +----------------
          "&" |  >     >     >
          "v" |  <     >     >
          ">" |  <     <     <
#+end_example

This table is part of a larger table which has rows and columns for symbols that are not binary operators: atomic formulas, negation, the two parentheses, and a terminator, say the period =.= The notion of a symbol having precedence over another now has to be extended to cover these other symbols.  It so turns out that apart from =<= and =>= a third entry, ===, is needed.  Finally, for illegal combinations, the entries can be error codes.

A minor problem arises about =v= being used as an infix connective and as an atomic formula.  In the case of recursive descent parsing there was no problem, even a formula such as =v v v v v= is correctly recognised as the three-fold disjunction of =v= with itself.  However, for operator precedence parsing this will not work, and henceforth we shall use =#= as the disjunction symbol.

That larger table can then be used to drive an algorithm which is a descendant of the one outlined at the end of the last section.  Instead of pushing symbols from the input onto the stack and then comparing them with what is below, the comparison is done between the current input symbol and the top element.  Instead of reducing only when the full right hand side of a production of the grammar has been seen, partial reductions take place.  Instead of reducing non-terminals (such as =F= in the example), the only symbols on the stack are terminals.  The net effect of the three changes is a very simple and very efficient bottom up parsing method:

#+begin_example
        Push a marker onto an otherwise empty stack
        WHILE stack contains more than one symbol OR
            the current input symbol is not the terminator DO
          LET R be the precedence relation between
            the symbol on top of the stack and the next input symbol
          IF R is < OR R is = THEN
            shift the next input symbol onto the stack
          ELSE IF R is > THEN
            REPEAT
              pop the top element off the stack
              UNTIL the precedence relation between
                the symbol on top of the stack and
                the most recently popped symbol is <
          ELSE abort with error R
#+end_example

With the information given so far, it should not be too difficult to write the program.  The precedence relations can be built into the algorithm at the =LET= part of the loop.  Alternatively, the algorithm can be left quite general and the =LET= part implemented as a lookup of a two dimensional array.  In this way it is this array or table which specifies the language; such table driven parsing is a popular implementation technique for bottom up parsers.  No matter which implementation is chosen, the hard part is to specify the precedence relations between symbols other than the infix operators.  A very minor addition to the program turns it into an infix to postfix translator.

The following is the record of an interaction with the program.  The program does not echo its input, which is ideal for interactive use.  After each prompt =ready=, it reads a formula typed by the user.  If the formula is preceded by =?=, then the program goes into tracing mode.  Note that the first three formulas are being parsed and translated in tracing mode, where the stack is now written horizontally.  For the remaining formulas tracing is switched off.  The last formulas contain intentional errors.

#+begin_example
$ RUN 15OPPRER.EXE
ready
?  a & b.
stack               infix-char          postfix-char
                    a
a                   &
                                        a
                    &
&                   b
&b                  .
                                        b
&                   .
                                        &
POSTFIX CODE : ab&
ready
?  (a & b) # (c & d).
stack               infix-char          postfix-char
                    (
(                   a
(a                  &
                                        a
(                   &
(&                  b
(&b                 )
                                        b
(&                  )
                                        &
(                   )
()                  #
                    #
#                   (
#(                  c
#(c                 &
                                        c
#(                  &
#(&                 d
#(&d                )
                                        d
#(&                 )
                                        &
#(                  )
#()                 .
#                   .
                                        #
POSTFIX CODE : ab&cd&#
ready
-a & -b # -(c > d) > e > f.
POSTFIX CODE : a-b-&cd>-#ef>>
ready
a&b&c&d&e&f&g&h&i&j.
POSTFIX CODE : ab&c&d&e&f&g&h&i&j&
ready
a>b>c>d>e>f>g>h>i>j.
POSTFIX CODE : abcdefghij>>>>>>>>>
ready
((a=b) # (c>d)) & -(e=f).
POSTFIX CODE : ab=cd>#ef=-&
ready
?  a & b b.
stack               infix-char          postfix-char
                    a
a                   &
                                        a
                    &
&                   b
&b                  b
error 0
ready
(((((((a&-b)).
error 2
ready
.
#+end_example

