06-operator-precedence.html

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> The algorithm</h3>
<div class="outline-text-3" id="text-3-1">


<p>
Consider arithmetic or logical expressions in minimally parenthesised notation as written in the first line and their fully parenthesised form in the second line.
</p>



<pre class="example">x +  y * z                      p v  q &amp; r
x + (y * z)                     p v (q &amp; r)
</pre>


<p>
The usual convention is that <code>*</code> binds more strongly than <code>+</code>, and that <code>&amp;</code> binds more strongly than <code>v</code>.  Hence <code>y</code> is an operand to <code>*</code> and not to <code>+</code>, and <code>q</code> is an operand to <code>&amp;</code> and not to <code>v</code>.  It helps to think of the operators on the left and right of <code>y</code> and <code>q</code> tugging at it, and <code>*</code> and <code>&amp;</code> win.  The technical notion is that <code>*</code> has precedence over <code>+</code>, and that <code>&amp;</code> has precedence over <code>v</code>.  For binary operators that are semantically associative it does not matter whether they have precedence over themselves, but for others it is important to distinguish those that are syntactically left-associative (such as subtraction and implication), and those that are syntactically right-associative (such as exponentiation in arithmetic).
</p>
<p>
We shall now design a parser for logical formulas in minimally parenthesised infix notation.  In the following table, the row headings are for the operator on the left of the disputed operand, and the column headings are for the operator on the right of the operand.  The table entries <code>&gt;</code> indicate that the row operator, when on the left, has precedence over the column operator, when on the right.  The table entries <code>&lt;</code> indicate the reverse.
</p>



<pre class="example">      "&amp;"   "v"   "&gt;"
    +----------------
"&amp;" |  &gt;     &gt;     &gt;
"v" |  &lt;     &gt;     &gt;
"&gt;" |  &lt;     &lt;     &lt;
</pre>


<p>
This table is part of a larger table which has rows and columns for symbols that are not binary operators: atomic formulas, negation, the two parentheses, and a terminator, say the period <code>.</code> The notion of a symbol having precedence over another now has to be extended to cover these other symbols.  It so turns out that apart from <code>&lt;</code> and <code>&gt;</code> a third entry, ===, is needed.  Finally, for illegal combinations, the entries can be error codes.
</p>
<p>
A minor problem arises about <code>v</code> being used as an infix connective and as an atomic formula.  In the case of recursive descent parsing there was no problem, even a formula such as <code>v v v v v</code> is correctly recognised as the three-fold disjunction of <code>v</code> with itself.  However, for operator precedence parsing this will not work, and henceforth we shall use <code>#</code> as the disjunction symbol.
</p>
<p>
That larger table can then be used to drive an algorithm which is a descendant of the one outlined at the end of the last section.  Instead of pushing symbols from the input onto the stack and then comparing them with what is below, the comparison is done between the current input symbol and the top element.  Instead of reducing only when the full right hand side of a production of the grammar has been seen, partial reductions take place.  Instead of reducing non-terminals (such as <code>F</code> in the example), the only symbols on the stack are terminals.  The net effect of the three changes is a very simple and very efficient bottom up parsing method:
</p>



<pre class="example">Push a marker onto an otherwise empty stack
WHILE stack contains more than one symbol OR
    the current input symbol is not the terminator DO
  LET R be the precedence relation between
    the symbol on top of the stack and the next input symbol
  IF R is &lt; OR R is = THEN
    shift the next input symbol onto the stack
  ELSE IF R is &gt; THEN
    REPEAT
      pop the top element off the stack
      UNTIL the precedence relation between
        the symbol on top of the stack and
        the most recently popped symbol is &lt;
  ELSE abort with error R
</pre>


<p>
With the information given so far, it should not be too difficult to write the program.  The precedence relations can be built into the algorithm at the <code>LET</code> part of the loop.  Alternatively, the algorithm can be left quite general and the <code>LET</code> part implemented as a lookup of a two dimensional array.  In this way it is this array or table which specifies the language; such table driven parsing is a popular implementation technique for bottom up parsers.  No matter which implementation is chosen, the hard part is to specify the precedence relations between symbols other than the infix operators.  A very minor addition to the program turns it into an infix to postfix translator.
</p>
<p>
The following is the record of an interaction with the program.  The program does not echo its input, which is ideal for interactive use.  After each prompt <code>ready</code>, it reads a formula typed by the user.  If the formula is preceded by <code>?</code>, then the program goes into tracing mode.  Note that the first three formulas are being parsed and translated in tracing mode, where the stack is now written horizontally.  For the remaining formulas tracing is switched off.  The last formulas contain intentional errors.
</p>



<pre class="example">$ RUN 15OPPRER.EXE
ready
?  a &amp; b.
stack               infix-char          postfix-char
                    a
a                   &amp;
                                        a
                    &amp;
&amp;                   b
&amp;b                  .
                                        b
&amp;                   .
                                        &amp;
POSTFIX CODE : ab&amp;
ready
?  (a &amp; b) # (c &amp; d).
stack               infix-char          postfix-char
                    (
(                   a
(a                  &amp;
                                        a
(                   &amp;
(&amp;                  b
(&amp;b                 )
                                        b
(&amp;                  )
                                        &amp;
(                   )
()                  #
                    #
