text/06-operator-precedence.org
** The program

The following is the Pascal source program for the operator precedence parser/translator based on precedence relations.  Note that the =VALUE= declaration is not standard Pascal, it initialises the (two dimensional) =ARRAY= of precedence relations.  Note that it this =ARRAY= which specifies the syntax of the input language, the remainder of the program is quite general.  (The =VALUE= declaration could be replaced by some other initialisation mechanism; one possibility is 64 assignment statements, another is 8 calls of a procedure with 8 parameters, another is reading the matrix from a file.)

#+begin_src pascal
PROGRAM opprer(input,output);
(* OPerator PREcedence Relations *)

LABEL 1;

CONST
marker = '.';
maxstack = 100;
maxcode = 300;

s_header = 'stack               ';
i_header = 'infix-char          ';
p_header = 'postfix-char        ';
big_tab  = '                    ';

TYPE
symbol =
    (atomsy,notsy,andsy,orsy,implsy,lpar,rpar,period);
VAR
p : ARRAY[symbol,symbol] OF char;       (* relations *)
s : ARRAY[0..maxstack] OF char;         (* parsing stack *)
t : integer;                            (* top of stack *)
sy : ARRAY[char] OF symbol;
ch : char;
tracing,finished : boolean;
i : integer;

code : ARRAY[1..maxcode] OF char;
cx : integer;

VALUE
p := ( (*        atm not and or  imp lp  rp  per *)
(* atm *)       ('0','>','>','>','>','1','>','>'),
(* not *)       ('<','<','>','>','>','<','>','>'),
(* and *)       ('<','<','>','>','>','<','>','>'),
(* or  *)       ('<','<','<','>','>','<','>','>'),
(* imp *)       ('<','<','<','<','<','<','>','>'),
(* lp  *)       ('<','<','<','<','<','<','=','2'),
(* rp  *)       ('3','>','>','>','>','4','>','>'),
(* per *)       ('<','<','<','<','<','<','5','6') );

PROCEDURE getch;
BEGIN
REPEAT
    read(ch)
    UNTIL ch > ' '
END; (* getch *)

PROCEDURE gen(c:char);
BEGIN (* gen *)
IF NOT (c IN ['(',')']) THEN
    BEGIN
    IF tracing THEN writeln(big_tab,big_tab,c);
    cx := cx + 1;
    code[cx] := c
    END
END; (* gen *)

BEGIN (* main *)
(* initialise table SY *)
FOR ch := chr(0) TO chr(255) DO
    IF ch IN ['A'..'Z','a'..'z','0','1']
        THEN sy[ch] := atomsy
    ELSE CASE ch OF
        '-'     : sy[ch] := notsy;
        '&'     : sy[ch] := andsy;
        '#'     : sy[ch] := orsy;
        '>','=' : sy[ch] := implsy;
        '('     : sy[ch] := lpar;
        ')'     : sy[ch] := rpar;
        '.'     : sy[ch] := period;
        OTHERWISE  sy[ch] := period
        END; (* CASE *)
1:
finished := false;
REPEAT
    writeln('ready');
    tracing := false;
    cx := 0;
    getch;
    IF ch = '.' THEN finished := true ELSE
        BEGIN
        IF ch = '?' THEN
            BEGIN tracing := true; getch END;

        (* BEGIN operator precedence parsing algorithm *)
        IF tracing THEN
            writeln(s_header,i_header,p_header);
        s[0] := marker; t := 0;
        WHILE (t > 0) OR (ch <> marker) DO
            BEGIN
            IF tracing THEN
                BEGIN
                FOR i := 1 TO t DO write(s[i]);
                FOR i := t+1 TO 15 DO write(' ');
                writeln('     ',ch)
                END; (* IF *)
            CASE  p[sy[s[t]],sy[ch]] OF
                '<', '=' :
                    BEGIN                               (* shift *)
                    t := t+1;
                    s[t] := ch;
                    getch
                    END;
                '>' :
                    BEGIN                               (* reduce *)
                    REPEAT
                        gen(s[t]);
                        t := t-1
                        UNTIL p[sy[s[t]],sy[s[t+1]]] = '<'
                    END;
                OTHERWISE
                    BEGIN
                    writeln('error ',p[sy[s[t]],sy[ch]]);
                    readln;
                    GOTO 1
                    END
                END (* CASE *)
            END; (* WHILE *)
        (* END operator precedence parsing algorithm *)

        write('POSTFIX CODE : ');
        FOR i := 1 TO cx DO write(code[i]);
        writeln
        END (* ELSE *)
    UNTIL finished
END. (* main *)
#+end_src

* Precedence functions

This section describes a variant of the algorithm which replaces the two dimensional (and hence potentially large) array of precedence relations by two one-dimensional arrays.

