06-operator-precedence.html
#                   (
#(                  c
#(c                 &amp;
                                        c
#(                  &amp;
#(&amp;                 d
#(&amp;d                )
                                        d
#(&amp;                 )
                                        &amp;
#(                  )
#()                 .
#                   .
                                        #
POSTFIX CODE : ab&amp;cd&amp;#
ready
-a &amp; -b # -(c &gt; d) &gt; e &gt; f.
POSTFIX CODE : a-b-&amp;cd&gt;-#ef&gt;&gt;
ready
a&amp;b&amp;c&amp;d&amp;e&amp;f&amp;g&amp;h&amp;i&amp;j.
POSTFIX CODE : ab&amp;c&amp;d&amp;e&amp;f&amp;g&amp;h&amp;i&amp;j&amp;
ready
a&gt;b&gt;c&gt;d&gt;e&gt;f&gt;g&gt;h&gt;i&gt;j.
POSTFIX CODE : abcdefghij&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;
ready
((a=b) # (c&gt;d)) &amp; -(e=f).
POSTFIX CODE : ab=cd&gt;#ef=-&amp;
ready
?  a &amp; b b.
stack               infix-char          postfix-char
                    a
a                   &amp;
                                        a
                    &amp;
&amp;                   b
&amp;b                  b
error 0
ready
(((((((a&amp;-b)).
error 2
ready
.
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The program</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The following is the Pascal source program for the operator precedence parser/translator based on precedence relations.  Note that the <code>VALUE</code> declaration is not standard Pascal, it initialises the (two dimensional) <code>ARRAY</code> of precedence relations.  Note that it this <code>ARRAY</code> which specifies the syntax of the input language, the remainder of the program is quite general.  (The <code>VALUE</code> declaration could be replaced by some other initialisation mechanism; one possibility is 64 assignment statements, another is 8 calls of a procedure with 8 parameters, another is reading the matrix from a file.)
</p>



<pre class="example">PROGRAM opprer(input,output);
(* OPerator PREcedence Relations *)

LABEL 1;

CONST
marker = '.';
maxstack = 100;
maxcode = 300;

s_header = 'stack               ';
i_header = 'infix-char          ';
p_header = 'postfix-char        ';
big_tab  = '                    ';

TYPE
symbol =
    (atomsy,notsy,andsy,orsy,implsy,lpar,rpar,period);
VAR
p : ARRAY[symbol,symbol] OF char;       (* relations *)
s : ARRAY[0..maxstack] OF char;         (* parsing stack *)
t : integer;                            (* top of stack *)
sy : ARRAY[char] OF symbol;
ch : char;
tracing,finished : boolean;
i : integer;

code : ARRAY[1..maxcode] OF char;
cx : integer;

VALUE
p := ( (*        atm not and or  imp lp  rp  per *)
(* atm *)       ('0','&gt;','&gt;','&gt;','&gt;','1','&gt;','&gt;'),
(* not *)       ('&lt;','&lt;','&gt;','&gt;','&gt;','&lt;','&gt;','&gt;'),
(* and *)       ('&lt;','&lt;','&gt;','&gt;','&gt;','&lt;','&gt;','&gt;'),
(* or  *)       ('&lt;','&lt;','&lt;','&gt;','&gt;','&lt;','&gt;','&gt;'),
(* imp *)       ('&lt;','&lt;','&lt;','&lt;','&lt;','&lt;','&gt;','&gt;'),
(* lp  *)       ('&lt;','&lt;','&lt;','&lt;','&lt;','&lt;','=','2'),
(* rp  *)       ('3','&gt;','&gt;','&gt;','&gt;','4','&gt;','&gt;'),
(* per *)       ('&lt;','&lt;','&lt;','&lt;','&lt;','&lt;','5','6') );

PROCEDURE getch;
BEGIN
REPEAT
    read(ch)
    UNTIL ch &gt; ' '
END; (* getch *)

PROCEDURE gen(c:char);
BEGIN (* gen *)
IF NOT (c IN ['(',')']) THEN
    BEGIN
    IF tracing THEN writeln(big_tab,big_tab,c);
    cx := cx + 1;
    code[cx] := c
    END
END; (* gen *)

BEGIN (* main *)
(* initialise table SY *)
FOR ch := chr(0) TO chr(255) DO
    IF ch IN ['A'..'Z','a'..'z','0','1']
        THEN sy[ch] := atomsy
    ELSE CASE ch OF
        '-'     : sy[ch] := notsy;
        '&amp;'     : sy[ch] := andsy;
        '#'     : sy[ch] := orsy;
        '&gt;','=' : sy[ch] := implsy;
        '('     : sy[ch] := lpar;
        ')'     : sy[ch] := rpar;
        '.'     : sy[ch] := period;
        OTHERWISE  sy[ch] := period
        END; (* CASE *)
1:
finished := false;
REPEAT
    writeln('ready');
    tracing := false;
    cx := 0;
    getch;
    IF ch = '.' THEN finished := true ELSE
        BEGIN
        IF ch = '?' THEN
            BEGIN tracing := true; getch END;

        (* BEGIN operator precedence parsing algorithm *)
        IF tracing THEN
            writeln(s_header,i_header,p_header);
        s[0] := marker; t := 0;
        WHILE (t &gt; 0) OR (ch &lt;&gt; marker) DO
            BEGIN
            IF tracing THEN
                BEGIN
                FOR i := 1 TO t DO write(s[i]);
                FOR i := t+1 TO 15 DO write(' ');
                writeln('     ',ch)
                END; (* IF *)
            CASE  p[sy[s[t]],sy[ch]] OF
                '&lt;', '=' :
                    BEGIN                               (* shift *)
                    t := t+1;
                    s[t] := ch;
                    getch
                    END;
                '&gt;' :
                    BEGIN                               (* reduce *)
                    REPEAT
                        gen(s[t]);
                        t := t-1
                        UNTIL p[sy[s[t]],sy[s[t+1]]] = '&lt;'
                    END;
                OTHERWISE
                    BEGIN
                    writeln('error ',p[sy[s[t]],sy[ch]]);
                    readln;
                    GOTO 1
                    END
                END (* CASE *)
            END; (* WHILE *)
        (* END operator precedence parsing algorithm *)

        write('POSTFIX CODE : ');
        FOR i := 1 TO cx DO write(code[i]);
        writeln
        END (* ELSE *)
    UNTIL finished
END. (* main *)
</pre>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Precedence functions</h2>
<div class="outline-text-2" id="text-4">


<p>
This section describes a variant of the algorithm which replaces the two dimensional (and hence potentially large) array of precedence relations by two one-dimensional arrays.
</p>

</div>
