text/06-operator-precedence.org
** The algorithm

The precedence relations between binary operators need not be transitive.  It is quite possible to have three infix operators O1, O2 and O3 such that O1 on the left has precedence over O2 on the right, that O2 on the left has precedence over O3 on the right, and yet O3 on the left has precedence over O1 on the right.  But for most purposes this possibility is not required at all, indeed users would probably find it confusing.  If the precedence relation can be made transitive and even linear, then it becomes possible to assign to each symbol a numeric precedence strength.  More precisely, for each symbol =s= two numbers are needed, conventionally called =f(s)= for the precedence on the left, and =g(s)= for the precedence on the right.  The algorithm now becomes:

#+begin_example
        Push a marker onto an otherwise empty stack
        WHILE stack contains more than one symbol OR
            the current input symbol is not the terminator DO
          IF f(the symbol on top of the stack)
              <= g(the next input symbol) THEN
            shift the next input symbol onto the stack
          ELSE
            REPEAT
              pop the top element off the stack
              UNTIL f(the symbol on top of the stack)
                < g(the symbol most recently popped)
#+end_example

The most difficult part is to find, for each input symbol, numeric values for the f and g functions.  When suitable values have been found, it is easy enough to put them into two arrays, say f and g.  Thus, just as the precedence relations program can be driven by a two dimensional array of relations, so the precedence functions program can be driven by two numeric arrays f and g.  There is no way to build error detection into the algorithm, see Aho and Ullman (1977, p 171), except by ad hoc methods.  But it is again an easy matter to extend the program just slightly so that it becomes a translator into postfix.  It is not essential that the postfix version uses exactly the same symbols, it is easy enough translate into a different symbolism.  (The sample program translates the infix constants =0= and =1= into the postfix constants =T= and =F=.)

The following is a record of an interaction with the program.  Like the preceding program, this one does not echo its input.  After each prompt =ready=, it reads a formula typed by the user.  If the formula is preceded by =?=, then the program goes into tracing mode.

#+begin_example
$ SET VERIFY
$ RUN  15OPPREF.EXE
ready
?  a & b.
stack               infix-char          postfix-char
                    a
a                   &
                                        a
                    &
&                   b
&b                  .
                                        b
&                   .
                                        &
POSTFIX CODE : ab&
ready
?  (a & b) # (c & d).
stack               infix-char          postfix-char
                    (
(                   a
(a                  &
                                        a
(                   &
(&                  b
(&b                 )
                                        b
(&                  )
                                        &
(                   )
()                  #
                    #
#                   (
#(                  c
#(c                 &
                                        c
#(                  &
#(&                 d
#(&d                )
                                        d
#(&                 )
                                        &
#(                  )
#()                 .
#                   .
                                        #
POSTFIX CODE : ab&cd&#
ready
-a & -b # -(c > d) > e > f.
POSTFIX CODE : a-b-&cd>-#ef>>
ready
a&b&c&d&e&f&g&h&i&j.
POSTFIX CODE : ab&c&d&e&f&g&h&i&j&
ready
a>b>c>d>e>f>g>h>i>j.
POSTFIX CODE : abcdefghij>>>>>>>>>
ready
((a=b) # (c>d)) & -(e=f).
POSTFIX CODE : ab=cd>#ef=-&
ready
(0 # 1) & (--1 > 0)  =  1 # 0 & 1.
POSTFIX CODE : FT#T--F>&TFT&#=
ready
.
#+end_example

** The program

The following is the standard Pascal source program for the parser/translator based on precedence functions.  Note that the input language and the translation to the output language are specified by the four string constants in the =CONST= declaration.  The remainder of the program is completely general.

#+begin_src pascal
PROGRAM oppref(input,output);
(* OPerator PREcedence Functions *)
(* CANNOT HANDLE ERRORS - SEE Aho and Ullman (1977, p 171) *)

CONST
numterminals = 36;
i0 = '=>#&-()abcdefghijklmnopqrstuvwxyz01.';
o0 = '=>#&-  abcdefghijklmnopqrstuvwxyzFT.';
f0 = '114660666666666666666666666666666660';
g0 = '223577077777777777777777777777777770';
marker = '.';
maxstack = 100;
maxcode = 300;

s_header = 'stack               ';
i_header = 'infix-char          ';
p_header = 'postfix-char        ';
big_tab  = '                    ';

VAR
o : ARRAY[char] OF char;        (* outputs *)
f,g : ARRAY[char] OF integer;   (* precedences *)
s : ARRAY[0..maxstack] OF char; (* parsing stack *)
t : integer;                    (* top of stack *)
ch : char;
code : ARRAY[1..maxcode] OF char;
cx : integer;
tracing,finished : boolean;
i : integer;

PROCEDURE initialise;
VAR i : integer;
    i1,o1,f1,g1 : PACKED ARRAY [1..numterminals] OF char;
BEGIN
i1 := i0; o1 := o0; f1 := f0; g1 := g0;
  (* this nonsense was necessary because silly PASCAL
  does not allow indexed access into constant strings *)
FOR ch := chr(0) TO chr(255) DO
    BEGIN f[ch] := -1; g[ch] := -1 END;
FOR i := 1 TO numterminals DO
    BEGIN
    f[i1[i]] := ord(f1[i]) - ord('0');
    g[i1[i]] := ord(g1[i]) - ord('0');
    o[i1[i]] := o1[i]
    END;
END; (* initialise *)

PROCEDURE getch;
BEGIN
REPEAT
    read(ch)
    UNTIL ch > ' '
END; (* getch *)

PROCEDURE putch;
VAR c : char;
BEGIN
c := o[s[t]];
IF c <> ' ' THEN
    BEGIN
    cx := cx + 1;
    code[cx] := c;
    IF tracing THEN writeln(big_tab,big_tab,c);
    END
END; (* putch *)

BEGIN (* main *)
initialise;
finished := false;
REPEAT
    writeln('ready');
    tracing := false;
    getch;
    IF ch = '.' THEN finished := true ELSE
        BEGIN
        IF ch = '?' THEN
            BEGIN tracing := true; getch END;
        IF tracing THEN writeln(s_header,i_header,p_header);

        (* BEGIN precedence function algorithm *)
        s[0] := marker; t := 0;
        cx := 0;
        WHILE (s[t] <> marker) OR (ch <> marker) DO
            BEGIN
            IF tracing THEN
                BEGIN
                FOR i := 1 TO t DO write(s[i]);
                FOR i := t+1 TO 15 DO write(' ');
                writeln('     ',ch)
                END;
            IF  f[s[t]] <= g[ch]  THEN
                BEGIN                           (* shift *)
                t := t+1; s[t] := ch;
                getch
                END
              ELSE
                REPEAT                          (* reduce *)
                    putch;
                    t := t-1
                    UNTIL f[s[t]] < g[s[t+1]]
            END; (* WHILE *)
        write('POSTFIX CODE : ');
        FOR i := 1 TO cx DO write(code[i]);
        writeln
        (* END precedence function algorithm *)

        END (* ELSE *)
    UNTIL finished;
END. (* main *)
#+end_src

* Exercises and reading

