text/06-operator-precedence.org
** /Ad hoc error detection/:
The precedence function algorithm cannot detect errors, because for any symbol on top of the stack and any input symbol, one of the three relations =>=, ===, =>= must hold for their =f=- and =g=-values.  Hence there is no way of encoding error conditions, as was done with the matrix of precedence relations.  For example, the algorithm will happily shift two adjacent atoms on the stack.  Find a way of adding extra /ad hoc/ code to the algorithm so that errors can be handled correctly.  You might experiment with a further function, say =h=.

** /Parsing without tables/:
Both programs are general, they are driven by tables which specify the input language and the translation.  It would be possible to write both programs without the tables.  Essentially this amounts to building the information which is now in the tables into the programs.  Rewrite either the precedence relations program or the precedence functions program in this way.

** /Changing the tables/:
Experiment with changing the table in the =VALUE= part of the precedence relations program, or the tables in the =CONST= part of the precedence functions program.  Can you change them so that the input language is in fully parenthesised infix or in prefix? If not, why not?

** /Evaluator/:
For either the precedence relations or the precedence functions program, modify the algorithm and then the program and the tables so as to make an evaluator for formulas without variables but only with constants =0= and =1=.

Write a parser which uses the method described towards the end of the first section of this chapter.  Your program could be, but need not be, driven by some kind of data structure playing the role of the tables used here.  Augment your parser so that it becomes a translator.

** /Non-recursive truth table program/:
Our truth table program had essentially three tasks to perform:

1) to translate from infix to postfix,
2) to generate all combinations of truth values, and
3) to evaluate the postfix.

Our program used recursion for 1) and 2), but used an explicit stack for 3).  Now this chapter has shown how to do 1) without recursion.  Can you think of a non-recursive way of doing 2)?  This would give you a truth table program which does not use recursion at all.  It should even be possible to write the entire program without any procedures; but many people would argue that such a style is unclear.

** /Reading/:

For a different exposition of operator precedences and a translator from arithmetic infix to postfix which also uses a two dimensional table but with slightly different stack operations, see Collins (1986, pp 117 - 145).

For an operator precedence program which translates from infix to postfix but which is not table driven, see McCracken (1987, pp 111 - 120).

For a detailed theoretically oriented exposition of operator precedence parsing, see Aho and Ullman (1977, Section 5.3).

A short but usable exposition of LR parsing is given in Capon and Jinks (1988, p 95).

A more detailed exposition is in Sudkamp (1988, Chapters 15 and 16).

For a very comprehensive treatment of LR-parsing,
see Chapman (1987).


