06-operator-precedence.html

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <i>Ad hoc error detection</i>:</h3>
<div class="outline-text-3" id="text-5-1">

<p>The precedence function algorithm cannot detect errors, because for any symbol on top of the stack and any input symbol, one of the three relations <code>&gt;</code>, ===, <code>&gt;</code> must hold for their <code>f</code>- and <code>g</code>-values.  Hence there is no way of encoding error conditions, as was done with the matrix of precedence relations.  For example, the algorithm will happily shift two adjacent atoms on the stack.  Find a way of adding extra <i>ad hoc</i> code to the algorithm so that errors can be handled correctly.  You might experiment with a further function, say <code>h</code>.
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <i>Parsing without tables</i>:</h3>
<div class="outline-text-3" id="text-5-2">

<p>Both programs are general, they are driven by tables which specify the input language and the translation.  It would be possible to write both programs without the tables.  Essentially this amounts to building the information which is now in the tables into the programs.  Rewrite either the precedence relations program or the precedence functions program in this way.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <i>Changing the tables</i>:</h3>
<div class="outline-text-3" id="text-5-3">

<p>Experiment with changing the table in the <code>VALUE</code> part of the precedence relations program, or the tables in the <code>CONST</code> part of the precedence functions program.  Can you change them so that the input language is in fully parenthesised infix or in prefix? If not, why not?
</p>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <i>Evaluator</i>:</h3>
<div class="outline-text-3" id="text-5-4">

<p>For either the precedence relations or the precedence functions program, modify the algorithm and then the program and the tables so as to make an evaluator for formulas without variables but only with constants <code>0</code> and <code>1</code>.
</p>
<p>
Write a parser which uses the method described towards the end of the first section of this chapter.  Your program could be, but need not be, driven by some kind of data structure playing the role of the tables used here.  Augment your parser so that it becomes a translator.
</p>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <i>Non-recursive truth table program</i>:</h3>
<div class="outline-text-3" id="text-5-5">

<p>Our truth table program had essentially three tasks to perform:
</p>
<ol>
<li>to translate from infix to postfix,
</li>
<li>to generate all combinations of truth values, and
</li>
<li>to evaluate the postfix.
</li>
</ol>


<p>
Our program used recursion for 1) and 2), but used an explicit stack for 3).  Now this chapter has shown how to do 1) without recursion.  Can you think of a non-recursive way of doing 2)?  This would give you a truth table program which does not use recursion at all.  It should even be possible to write the entire program without any procedures; but many people would argue that such a style is unclear.
</p>
</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-6">


<p>
For a different exposition of operator precedences and a translator from arithmetic infix to postfix which also uses a two dimensional table but with slightly different stack operations, see Collins (1986, pp 117 - 145).
</p>
<p>
For an operator precedence program which translates from infix to postfix but which is not table driven, see McCracken (1987, pp 111 - 120).
</p>
<p>
For a detailed theoretically oriented exposition of operator precedence parsing, see Aho and Ullman (1977, Section 5.3).
</p>
<p>
A short but usable exposition of LR parsing is given in Capon and Jinks (1988, p 95).
</p>
<p>
A more detailed exposition is in Sudkamp (1988, Chapters 15 and 16).
</p>
<p>
For a very comprehensive treatment of LR-parsing,
see Chapman (1987).
</p>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:38:08 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
